# IdeaStatiCa.ConnectionApi.Model.ParameterUpdateResponse

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**SetToModel** | **bool** |  | [optional]
**Parameters** | **List&lt;IdeaParameter&gt;** |  | [optional]
**FailedValidations** | **List&lt;Object&gt;** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)